#pragma once
#include "inttypes.h"

const char *help_text[26]={ 
"         Приветствуем Вас!!!         ",
"   Данный проект предназначен для    ",
"     \"минималистичной\" эмуляции      ",
"  компьютера \"ZX-Spectrum\" на базе   ",
"   контроллера Raspberry Pi Pico.    ",
"*************************************",
"     ---==[Горячие клавиши]==---     ",
"[F1]            - Помощь             ",
"[HOME]          - Файловый менеджер  ",
"[Ctrl+Alt+Del]  - Сброс эмулятора    ",
"[Shift+Alt+Del] - Сброс контроллера  ",
"[Ctrl+F1-F10]   - Сохранение образа  ",
"         .z80 в папку \"SAVE\" SD карты",
"[Shift+F1-F10]  - Загрузка образа    ",
"        .z80 из папки \"SAVE\" SD карты",
"[Pause]         - Остановка эмуляции ",
"                                     ",
"--=[Навигация в файловом менджере]=--",
"[Курсорные клавиши:]                 ",
"[Стрелка влево]  - Начало списка     ",
"[Стрелка вправо] - Конец списка      ",
"[Стрелка вверх]  - Предыдущий файл   ",
"[Стрелка вниз]   - Следующий файл    ",
"[PageUp]         - Страница вверх    ",
"[PageDn]         - Страница вниз     ",
"[Enter]          - Запуск образа     "
};